app/controllers/carts_controller.rb

  def show
    @user = current_user
    @cart = current_user.cart
    @single_cart_pics = SingleCartPic.where(cart: @cart)
    @user_id = User.friendly.find(params[:user_id])
    sum = 0
    @single_cart_pics.each do |k|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "single_cart_pics".* FROM "single_cart_pics"