app/controllers/carts_controller.rb

SELECT  "cat_pictures".* FROM "cat_pictures" WHERE "cat_pictures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show

	@cart = Cart.find(params[:id])
	@cat = CatPicture.find(params[:id])