app/controllers/cat_pictures_controller.rb

  def index
  	@cat_pictures = CatPicture.all.order("title ASC")
---
SELECT "cat_pictures".* FROM "cat_pictures" ORDER BY title ASC

  def show
  	@id=params[:id]
  	@cat_picture=CatPicture.where('id=?',@id).first
---
SELECT  "cat_pictures".* FROM "cat_pictures" WHERE (id='8') ORDER BY "cat_pictures"."id" ASC LIMIT $1  [["LIMIT", 1]]