app/controllers/single_cart_pics_controller.rb

SELECT  "single_cart_pics".* FROM "single_cart_pics" WHERE "single_cart_pics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
		@single_cart_pic = SingleCartPic.find(params[:id])

SELECT  "single_cart_pics".* FROM "single_cart_pics" WHERE "single_cart_pics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "single_cart_pics" WHERE "single_cart_pics"."id" = $1  [["id", 1]]
---
  def destroy
		@single_cart_pic = SingleCartPic.find(params[:id])
		@single_cart_pic.delete