app/models/cat_pic_tag.rb

  def no_tags_duplicata
    CatPicTag.all.each do |cat_pic_tag|
---
SELECT "cat_pic_tags".* FROM "cat_pic_tags"