app/models/single_cart_pic.rb

SELECT "single_cart_pics".* FROM "single_cart_pics"
---
  def no_single_cart_pic_duplicata
    SingleCartPic.all.each do |single_cart_pic|