app/views/cat_pictures/index.html.erb

SELECT "cat_pictures".* FROM "cat_pictures" ORDER BY title ASC
---
                    <section class="slice-sm sct-color-1">
                        <%@cat_picture=CatPicture.all.order("title ASC")%>