app/views/cat_pictures/show.html.erb

<% @id=params[:id]%>
<%@cat_picture=CatPicture.where('id=?',@id).first%>
---
SELECT  "cat_pictures".* FROM "cat_pictures" WHERE (id='4') ORDER BY "cat_pictures"."id" ASC LIMIT $1  [["LIMIT", 1]]